app/controllers/analytics_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "events" ("user_id", "name", "description", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def index
    dates = ((Date.today-5.days)..(Date.today+5.days)).to_a
    @dates = []
    dates.each do |date|
      @dates << date.strftime("%B %d, %Y")
    end

    users = User.all
    @data = []
    users.each do |user|
      @data << {name: user.name, data: user.events_summary(dates)}