app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	event_params = params[:event]
  	event_params[:start_time] = process_date_time_string(event_params[:start_time])
  	event_params[:end_time] = process_date_time_string(event_params[:end_time])
  	event_params[:user_id] = current_user.id
  	@event = Event.new(event_params.permit!)
  	@event.save!