app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @events = Event.generate_events_hash(@user)
    @users = User.all